{
   "data": [
      {
         "description": "This Rite is an Energetic Transmission given by a Lineage of Women from the Jungle Medicine of Peru, to release past traumas stored in our womb. \n\n\tIt heals at the cellular and energetic levels. \n\tIt gives us the capability for deep emotional \tand \tphysical healing. \n\tIt heals the Lineage from pain and suffering -Ancestral Healing. \n\n“The womb is not a place to store fear or pain. \nThe womb is to create and give birth to life.”\n\nThe intention of the rite is not only for personal healing of the physical and psychic center of the womb for individual women, but for the collective damage and oppression that women have felt for many generations around the world, and also to provide healing to our beloved Mother  Earth.\n\nMen are welcome to attend and they may receive the transmission. \nThis rite is to heal the womb and occasionally there is a man that feels the need to heal his psychic womb. Sometimes these men had very traumatic experiences in their mother’s wombs or had a very dysfunctional relationship with the feminine aspect of life. If a man asks to receive this rite with a sincere heart then is appropriate to share it with him.\n\nPre-registration  required:  Call Rosalba at 818-257-0407 to reserve your place.\n\nThere is preparation of ceremonial items and information for each participant, therefore we need to know how many people will attend.\n  \nSuggested Donation:  $20 (at site)\n\nRev. Rosalba Fontanez\nShamanic Energy Practitioner, Teacher and Womb Keeper.\n818-257-0407\nrosalbafontanez\u0040gmail.com            www.rosalbafontanez.com\n\n*(Once you enter the park, drive about a mile into the mountain; we will be on the right side on the grassy, picnic area - right across from the main restrooms.)",
         "end_time": "2017-07-22T13:00:00-0700",
         "name": "Rite of the Womb Initiation",
         "place": {
            "name": "Wildwood Canyon Park  1701 Wildwood Canyon, Burbank, CA. 91501"
         },
         "start_time": "2017-07-22T10:00:00-0700",
         "id": "1218154434997794"
      },
      {
         "description": "Here is your escape to a country retreat in the city! Located up historic Country Club Drive, a unique canyon street above Burbank that makes you feel like you are miles from civilization, yet you are truly just minutes away! This 2 bedroom charmer was built in 1924, purportedly by Eddie LeVeque, of the original Keystone Kops! Oozing with charming details including stone walls, hardwood floors, and vintage windows. The living room has a cool fireplace, and views out to a side veranda for al fresco dining. The kitchen has everything you need in a very efficient space with tile counters. There is a full bath that was remodeled with tumbled stone. Upstairs are 2 bedrooms, with some original heart of pine floors, and a half bath. There are lush mountain views out of the windows, and an upper terrace was plumbed for a spa. The detached 2-car garage has a charging station for a Tesla or other electric vehicle. This charmer is sure to please!",
         "end_time": "2017-07-08T16:00:00-0700",
         "name": "Open House Burbank House",
         "place": {
            "name": "711 Country Club Dr, Burbank, CA 91501-1123, United States"
         },
         "start_time": "2017-07-08T14:00:00-0700",
         "id": "1918837431689141"
      }
   ],
   "paging": {
      "cursors": {
         "before": "MAZDZD",
         "after": "MQZDZD"
      },
      "next": "https://graph.facebook.com/v2.9/search?access_token=EAAbDO1iQ2IUBABrGtYLv9aZB6NwKZAaLWHeYFa5CBTMXWnIlfvoQbSxHrXol4ccxmVujMio874pkqmICY745NcCZBh0MhpBOvZCVxSclYatRTSPq7heRydaxbpZADey3zuJR1e1ZC7ga0YlQZBvoUZBfhHuupwISnwc8qZCNxUl2xEyV0nspaeLZCYyspAsBAZBuccZD&pretty=1&q=91501&type=event&limit=25&after=MQZDZD"
   }
}
